Revit 2027 API
ColorSelectionDialog.Show Method
 Shows the Revit Color dialog as a modal dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ItemSelectionDialogResult Show()
Public Function Show As ItemSelectionDialogResult
public:
ItemSelectionDialogResult Show()
member Show : unit -> ItemSelectionDialogResult
Return Value
ItemSelectionDialogResult
 A status indicating whether the user selected a color or cancelled the dialog without making a selection.
See Also
Reference
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace